// Script assets have changed for v2.3.0 see
// https://help.yoyogames.com/hc/en-us/articles/360005277377 for more information

//gojuon 五十音
//(han)dakuten (半)濁点
//yōon ようおん	

//////////////////////////
//
// KATAKANA
//
//////////////////////////

global.katakana_gojuon = [ //五十音 (50 standard kana)
	
	["",""],
	["a",""],
	["i",""],
	["u",""],
	["e",""], //6
	["o",""],//1

	["",""],
	["ア","a"],
	["イ","i"],
	["ウ","u"],
	["エ","e"],//12
	["オ","o"],//2
	
	["K",""],
	["カ","ka"],
	["キ","ki"],
	["ク","ku"],
	["ケ","ke"],//18
	["コ","ko"],//3

	["S",""],
	["サ","sa"],
	["シ","shi"],
	["ス","su"],
	["セ","se"],//24
	["ソ","so"],//4

	["T",""],
	["タ","ta"],
	["チ","chi"],
	["ツ","tsu"],
	["テ","te"],//30
	["ト","to"],//5

	["N",""],
	["ナ","na"],
	["ニ","ni"],
	["ヌ","nu"],
	["ネ","ne"],//36
	["ノ","no"],//6

	["H",""],
	["ハ","ha"],
	["ヒ","hi"],
	["フ","fu"],
	["ヘ","he"],//42
	["ホ","ho"],//7

	["M",""],
	["マ","ma"],
	["ミ","mi"],
	["ム","mu"],
	["メ","me"],//48
	["モ","mo"],//8
	
	["R",""],
	["ラ","ra"],
	["リ","ri"],
	["ル","ru"],
	["レ","re"],//
	["ロ","ro"],//9

	["Y",""],
	["ヤ","ya"],
	[" ",""],
	["ユ","yu"],
	[" ",""],
	["ヨ","yo"],//10
	
	["W",""],
	["ワ","wa"],
	[" ",""],
	[" ",""],
	[" ",""],
	["ヲ","wo"],//11
	
	["N",""],
	["ン","n"],	
	
	[12,6]// number of columns , number of rows in the columns.
	]

global.katakana_handakuten=[
	
	["",""],
	["a",""],
	["i",""],
	["u",""],
	["e",""],
	["o",""],//6
	
	["G",""],
	["ガ","ga"],
	["ギ","gi"],
	["グ","gu"],
	["ゲ","ge"],
	["ゴ","go"],//12
	
	["Z",""],
	["ザ","za"],
	["ジ","zi"],
	["ズ","zu"],
	["ゼ","ze"],
	["ゾ","zo"],//18
	
	["D",""],
	["ダ","da"],
	["ヂ","di"],
	["ヅ","du"],
	["デ","de"],
	["ド","do"],//24
	
	["B",""],
	["バ","ba"],
	["ビ","bi"],
	["ブ","bu"],
	["ベ","be"],
	["ボ","bo"],//30
	
	["",""],
	["",""],
	["",""],
	["",""],
	["",""],
	["",""],//11
	
	["P",""],
	["パ","pa"],
	["ピ","pi"],
	["プ","pu"],
	["ペ","pe"],
	["ポ","po"],//36
	[7,6] // number of columns , number of rows in the columns.
	]	
	
global.katakana_yoon=[	
	
	["",""],
	["ャ\nya","-"],
	["ュ\nyu","-"],
	["ョ\nyo","-"], //1
	
	["キ ki",""],	
	["キャ","kya"],
	["キュ","kyu"],
	["キョ","kyo"],	//2
	
	["シ shi",""],
	["シャ","sha"],
	["シュ","shu"],
	["ショ","sho"], //3
	
	["チ chi",""],
	["チャ","cha"],
	["チュ","chu"],
	["チョ","cho"],	//4
	
	["ニ ni",""],
	["ニャ","nya"],
	["ニュ","nyu"],
	["ニョ","nyo"], //5
	
	["ヒ hi",""],
	["ヒャ","hya"],
	["ヒュ","hyu"],
	["ヒョ","hyo"], //6
	
	["ミ mi",""],
	["ミャ","mya"],
	["ミュ","myu"],
	["ミョ","myo"],//7
	
	["リ ri",""],
	["リャ","rya"],
	["リュ","ryu"],
	["リョ","ryo"], //8
	
	["-","-"],
	["-","-"],
	["-","-"],
	["-","-"],//9

	["ギ gi",""],
	["ギャ","gya"],
	["ギュ","gyu"],
	["ギョ","gyo"], //10
	
	["ジ ji",""],
	["ジャ","ja"],
	["ジュ","ju"],
	["ジョ","jo"], //11
		
	["ビ bi",""],
	["ビャ","bya"],
	["ビュ","byu"],
	["ビョ","byo"], //12
	
	["-","-"],
	["-","-"],
	["-","-"],
	["-","-"], //13
	
	["ピ pi",""],
	["ピャ","pya"],
	["ピュ","pyu"],
	["ピョ","pyo"], //14 
	[14,4] // number of columns , number of rows in the columns.
	]
	
//////////////////////////
//
// HIRAGANA
//
//////////////////////////
	
global.hiragana_gojuon=[ //五十音 (50 standard kana)

	["",""],
	["a",""],
	["i",""],
	["u",""],
	["e",""],
	["o",""],//6
	
	["",""],
	["あ","a"],
	["い","i"],
	["う","u"],
	["え","e"],
	["お","o"],//12
	
	["K",""],
	["か","ka"],
	["き","ki"],
	["く","ku"],
	["け","ke"],
	["こ","ko"],//18	
	
	["S",""],
	["さ","sa"],
	["し","shi"],
	["す","su"],
	["せ","se"],
	["そ","so"],//24
	
	["T",""],
	["た","ta"],
	["ち","chi"],
	["つ","tsu"],
	["て","te"],
	["と","to"],//30
		
	["N",""],
	["な","na"],
	["に","ni"],
	["ぬ","nu"],
	["ね","ne"],
	["の","no"],//36
	
	["H",""],
	["は","ha"],
	["ひ","hi"],
	["ふ","hu"],
	["へ","he"],
	["ほ","ho"],//42
	
	["M",""],
	["ま","ma"],
	["み","mi"],
	["む","mu"],
	["む","me"],
	["も","mo"],//42	

	["Y",""],
	["や","ya"],
	["",""],
	["ゆ","yu"],
	["",""],
	["よ","yo"],

	["R",""],
	["ら","ra"],
	["り","ri"],
	["る","ru"],
	["れ","re"],
	["ろ","ro"],//48

	["W",""],
	["わ","Wa"],
	[" ",""],
	[" ",""],
	[" ",""],
	["を","Wo"],//48
	
	["N",""],//53
	["ん","n"],//53
	
	[13,6] // number of columns , number of rows in the columns.	
	]

// maybe add both the diacrits and the "both"
// sections together
global.hiragana_handakuten=[

	["",""],
	["a",""],
	["i",""],
	["u",""],
	["e",""],
	["o",""],//6
	
	["G",""],
	["が","ga"],
	["ぎ","gi"],
	["ぐ","gu"],
	["げ","ge"],
	["ご","go"],//12
	
	["Z",""],
	["ざ","za"],
	["じ","zji"],
	["ず","zu"],
	["ぜ","ze"],
	["ぞ","zo"],//18
	
	["D",""],
	["だ","da"],
	["ぢ","dji"],
	["づ","dzu"],
	["で","de"],
	["ど","do"],//24
	
	["B",""],
	["ば","ba"],
	["び","bi"],
	["ぶ","bu"],
	["べ","be"],
	["ぼ","bo"],//30
	
	["",""],
	["",""],
	["",""],
	["",""],
	["",""],
	["",""],//11
	
	
	["P",""],
	["ぱ","pa"],//not appearing for some reason
	["ぴ","pi"],
	["ぷ","pu"],
	["ぺ","pe"],//not appearing for some reason
	["ぽ","po"],
	
	[7,6]// number of columns , number of rows in the columns.
	]
	
global.hiragana_yoon=[

	["",""],
	["ゃ\nya","-"],
	["ゅ\nyu","-"],
	["ょ\nyo","-"], //1

	["き ki",""],
	["きゃ","kya"],
	["きゅ","kyu"],
	["きょ","kyo"], //2
	
	["し shi",""],
	["しゃ","sha"],
	["しゅ","shu"],
	["しょ","sho"],//3
	
	["ち chi",""],
	["ちゃ","cha"],
	["ちゅ","chu"],
	["ちょ","cho"], //4
	
	["に ni",""],
	["にゃ","nya"],
	["にゅ","nyu"],
	["にょ","nyo"],//5

	["ひ hi",""],
	["ひゃ","hya"],
	["ひゅ","hyu"],
	["ひょ","hyo"], //6
	
	["み mi",""],
	["みゃ","mya"],
	["みゅ","myu"],
	["みょ","myo"],//7
	
	["り ri",""],
	["りゃ","rya"],
	["りゅ","ryu"],
	["りょ","ryo"],//8
	
	["-","-"],
	["-","-"],
	["-","-"],
	["-","-"], //9

	["ぎ gi",""],
	["ぎゃ","gya"],
	["ぎゅ","gyu"],
	["ぎょ","gyo"], //10
	
	["じ ji",""],
	["じゃ","ja"],
	["じゅ","ju"],
	["じょ","jo"],//11
	
	["び bi",""],
	["びゃ","bya"],
	["びゅ","byu"],
	["びょ","byo"],//12
	
	["-","-"],
	["-","-"],
	["-","-"],
	["-","-"], //13
	
	["ぴ pi",""],
	["ぴゃ","pya"],
	["ぴゅ","pyu"],
	["ぴょ","pyo"],//14
	
	[14,4]
	]
